Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkAttributes.LineLengthOffset Property
 The offset from the end of the line on both sides of the section mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double LineLengthOffset { get; set; }
Public Property LineLengthOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SectionMarkBase.SectionMarkAttributes Class
Tekla.Structures.Drawing Namespace